<template>
  <div class="bottomMain">
    <div class="mainLeft">
      <h3 class="leftTitle">大健康解决方案简报查询</h3>
      <div class="overviewArea" v-if="searchType === 0">
        <p class="backgroundTxt" v-if="localContent === ''"><i class="el-icon-search"></i>您可使用右侧工具栏中在数据库中查找您需要的简报</p>
        <div class="overViewArea" v-else v-html="localContent"></div>
      </div>
      <div class="netArea" v-if="searchType === 1">
        <p class="backgroundTxt" v-if="netUrl === ''"><i class="el-icon-eleme"></i>您可使用右侧工具栏中在网络中查找您需要的信息</p>
        <iframe class="overViewArea" :src="netUrl" scrolling="yes" v-if="netUrl !== ''"></iframe>
      </div>
    </div>
    <div class="mainRight">
      <ul class="searchTypeTab">
        <li :class="{active:searchType === 0}" @click="searchTypeFn(0)">本地获取</li>
        <li :class="{active:searchType === 1}" @click="searchTypeFn(1)">网络截取</li>
      </ul>
      <div class="localArea" v-if="searchType === 0">
        <h3 class="searchTitle">文件列表</h3>
        <p class="searchCount">数据库中《大健康解决方案简报》文件共<span>88888</span>个<i class="el-icon-refresh-left"></i></p>
        <el-form ref="form" :model="localForm" label-width="80px">
          <el-form-item label="搜索内容">
            <el-input v-model="localForm.content" style="width:340px;">
              <i slot="suffix" class="searchBtn el-input__icon el-icon-search" @click="localSubmit"></i>
            </el-input>
          </el-form-item>
          <el-form-item label="时间范围">
            <el-date-picker v-model="localForm.duringDate" type="daterange" :picker-options="pickerOptions"
              range-separator="至" start-placeholder="开始日期" end-placeholder="结束日期" value-format="timestamp"
              style="width:340px;">
            </el-date-picker>
          </el-form-item>
        </el-form>
        <div class="localFileWrap">
          <p class="lineGrap">
            <span>全部下载</span>
          </p>
          <div class="fileItem" v-for="(item,index) in localFiles" :key="index">
            <h4 class="fileTitle">{{item.title}}</h4>
            <p class="content" v-html="item.content"></p>
            <div class="fileBottom">
              <span>时间：{{dateFormat(item.createTime)}}</span>
              <span class="overview" @click="localOverview(item.content)">预览</span>
              <i class="download el-icon-download"></i>
            </div>
          </div>
          <!--分页-->
          <div class="paginationWrap">
            <el-pagination :current-page.sync="currentPage" :page-size="pageSize"
              layout="total, prev, pager, next, jumper" :total="total" @size-change="handleSizeChange"
              @current-change="handleCurrentChange" />
          </div>
        </div>
      </div>
      <div class="netFileWrap" v-if="searchType === 1">
        <h3 class="searchTitle">网络截取</h3>
        <el-form ref="netForm" :model="netForm" label-width="80px">
          <el-form-item label="搜索内容">
            <el-input v-model="netForm.content" style="width:340px;">
              <i slot="suffix" class="searchBtn el-input__icon el-icon-search" @click="netSubmit"></i>
            </el-input>
          </el-form-item>
          <el-form-item label="查询范围">
            <el-radio-group v-model="netForm.searchScope">
              <el-radio label="全网查询"></el-radio>
              <el-radio label="自定义网站查询"></el-radio>
            </el-radio-group>
          </el-form-item>
        </el-form>
        <div class="nwtFileWrap">
          <div class="fileItem" v-for="(item,index) in netFiles" :key="index">
            <h4 class="fileTitle">{{item.title}}</h4>
            <p class="content" @click="netOverview(item.url)">{{item.url}}</p>
          </div>
          <!--分页-->
          <div class="paginationWrap">
            <el-pagination :current-page.sync="currentPage" :page-size="pageSize"
              layout="total, prev, pager, next, jumper" :total="total" @size-change="handleSizeChange"
              @current-change="handleCurrentChange" />
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      searchType: 0, // 搜索类型
      total: 3, // 文件列表格总数
      currentPage: 1, // 文件列表当前页码
      pageSize: 3, // 文件列表整页大小
      // 本地搜索表单
      localForm: {
        content: '',
        duringDate: []
      },
      localContent: '',
      localFiles: [
        // 本地搜素文件列表
        {
          title:
            '标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题',
          content:
            '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
          createTime: 1583889762885
        },
        {
          title:
            '标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题',
          content:
            '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
          createTime: 1583889762885
        },
        {
          title:
            '标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题标题',
          content:
            '内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容',
          createTime: 1583889762885
        }
      ],
      netForm: {
        // 网络搜索表单
        content: '',
        searchScope: ''
      },
      netFiles: [
        // 网络搜素文件列表
        {
          title: '研究方法',
          url: 'https://baike.baidu.com/item/%E7%A0%94%E7%A9%B6%E6%96%B9%E6%B3%95/3923699'
        },
        {
          title: '慕课网',
          url: 'https://www.imooc.com/'
        },
        {
          title: '4.5w字🔥建议收藏）“可能是” 2020最值得看的小程序系列实战教程',
          url: 'https://juejin.im/post/5e670c19e51d45270764ee14'
        }
      ],
      netUrl: '',
      pickerOptions: {
        shortcuts: [
          {
            text: '最近半年',
            onClick(picker) {
              const end = new Date()
              const start = new Date()
              start.setTime(start.getTime() - 3600 * 1000 * 24 * 180)
              picker.$emit('pick', [start, end])
            }
          },
          {
            text: '最近一年',
            onClick(picker) {
              const end = new Date()
              const start = new Date()
              start.setTime(start.getTime() - 3600 * 1000 * 24 * 365)
              picker.$emit('pick', [start, end])
            }
          }
        ]
      }
    }
  },
  methods: {
    // 时间格式化
    dateFormat(dateTime) {
      var date = new Date(dateTime) //时间戳为10位需*1000，时间戳为13位的话不需乘1000
      var year = date.getFullYear(),
        month = ('0' + (date.getMonth() + 1)).slice(-2),
        sdate = ('0' + date.getDate()).slice(-2),
        hour = ('0' + date.getHours()).slice(-2),
        minute = ('0' + date.getMinutes()).slice(-2),
        second = ('0' + date.getSeconds()).slice(-2)
      return (
        year +
        '-' +
        month +
        '-' +
        sdate +
        ' ' +
        hour +
        ':' +
        minute +
        ':' +
        second
      )
    },
    // 本地文件预览
    localOverview(content) {
      this.localContent = content
    },
    //
    netOverview(url) {
      this.netUrl = url
    },
    // 搜索类型切换
    searchTypeFn(data) {
      this.searchType = data
    },
    // 本地文件搜索
    localSubmit() {
      console.log(this.localForm)
    },
    // 网络搜索
    netSubmit() {
      console.log(this.localForm)
    },
    // pageSize 改变时会触发
    handleSizeChange(val) {
      // this.queryParams.PageSize = val
      // this.queryProjectTableFn()
    },
    // currentPage 改变时会触发
    handleCurrentChange(val) {
      // this.queryParams.Page = val
      // this.queryProjectTableFn()
    }
  }
}
</script>
<style lang="scss" scoped>
@import './solution.scss';
</style>